/**
  ******************************************************************************
  * @file    temperature.c
  * @author  LL
  * @version V0.0.0
  * @date    2016-04-20
  * @brief   
  ******************************************************************************
  ******************************************************************************
***/

#include "config.h"

//NTC温度数据表
#define  START_TEMP  0    //最低温度
#define  END_TEMP    175  //最高温度
#define  TEMP_RANGE  176

//10K
static const uint32_t NTCTemp_ResistorValue[TEMP_RANGE] =
{   //0
	324999,
    //1-10
    308857, 293612, 279207, 265591, 252716, 240536, 229011, 218100, 207769, 197983,
    //11-20
    188711, 179922, 171589, 163687, 156190, 149076, 142324, 135913, 129825, 124042,
    //21-30
    118548, 113325 , 108360, 103640, 100000, 96512, 92378, 88442, 84696, 81128,
    //31-40
    77729, 74492, 71406, 68465, 65661, 62998, 60437, 58039, 55682, 53466,
    //41-50
    51349, 49329, 47398, 45554, 43792, 42108, 40497, 38957, 37484, 36069,
    //51-60
    34726, 33435, 32220, 31016, 29883, 28797, 27765, 26759, 25803, 24886,
    //61-70
    24007, 23163, 22354, 21557, 20831, 20115, 19428, 18767, 18133, 17523,
    //71-75
    16937, 16373, 15831, 15310, 14809, 
	//75-80
	14327, 13862, 13416, 12985, 12571,
    //81-90
    12172, 11788, 11410, 11050, 10625, 10374, 10065, 9756, 9458, 9171,
    //91-100
    8894, 8627, 8369, 8119, 7879, 7646, 7421, 7204, 6995, 6792,
    //101-110
    6596, 6406, 6223, 6046, 5874, 5708, 5548, 5393, 5242, 5097,
    //111-120
    4956, 4819, 4687, 4559, 4435, 4314, 4198, 4085, 3975, 3869,
    //121-130
    3766, 3666, 3570, 3476, 3384, 3296, 3210, 3127, 3046, 2967,
    //131-140
    2891, 2817, 2745, 2676, 2608, 2542, 2478, 2416, 2355, 2296,
    //141-150
    2239, 2184, 2130, 2077, 2026, 1977, 1928, 1881, 1836, 1791,
    //151-160
    1752, 1715, 1678, 1642, 1607, 1573, 1540, 1508, 1477, 1446,
    //161-170
    1416, 1387, 1358, 1331, 1304, 1277, 1252, 1227, 1202, 1178,
    //171-175
    1155, 1132, 1110, 1089, 1068, 
    //175-180
//    1047, 1027, 1007, 988, 969,	

};

#define TEMP_HIGHSTOP_VAL 175 /*温度高停止*/
#define TEMP_HIGH_VAL 170 /*温度高*/
#define TEMP_LOW_VAL 80 /*温度低*/
    
/*******************************************************************************
* Function Name  : Temperature_NTC
* Description    : 温度处理，NTC热敏电阻温度检测处理

检测方法,根据RC检测转化后的电阻值，然后查表求出温度。
根据对数据准求性的要求，可以进行多次采样平均或一次采样，多次采样可能需要的时间要长一点

* Input          : None
* Output         : None
* Return         : 实际的温度数据
*******************************************************************************/

uint16_t Temperature_NTC(void)
{
    
    u8 i;
    u16 tmp_volt = 0;
    float tmp_curr = 0.0f;
    u32   NTCImp = 0;
    u8 temperature = 0;
	u16  adc_value = 0;
	
    adc_value = ADC_ConverStable();
	
    tmp_volt = (uint32_t)adc_value*3300/1023;
	
    
	tmp_curr = (3300.0f - (float)tmp_volt) / 2.2f;//计算电流	
    NTCImp = (u32)(tmp_volt / tmp_curr*10000.0f);//计算阻值 = 电压/电流 
    
    for( i = 0; i < 176; i++)
    {
        if((NTCImp <= NTCTemp_ResistorValue[i])&&(NTCImp >= NTCTemp_ResistorValue[i + 1]))
        {
            temperature = i;
            break;
        }
    }

	if(NTCImp<=NTCTemp_ResistorValue[175])
	{
       temperature = 175;
	}

	if(NTCImp>NTCTemp_ResistorValue[0])
	{
       temperature = 0;   
	}
	
    return temperature;


}

uint8_t ucTemperature = 0;

/*******************************************************************************
* Function Name  : Temperature_Read
* Description    : 读温度数据
* Input          : None               
* Output         : None
* Return         : None
* Date           : 2016-05-21
* Author         : LL
*******************************************************************************/
void Temperature_Read(void)
{
  uint16_t tempvalue;
  uint8_t  buf[4];
  tempvalue = Temperature_NTC();
  ucTemperature = tempvalue;
  buf[0] = '+';
  buf[1] = 0;
  buf[2] = tempvalue & 0xFF;
  Protocol_PrintfData(COMMANDSTATE_SEND,0x08,buf,3);

}

/*******************************************************************************
* Function Name  : Temperature_Process
* Description    : 温度相关的处理，对外调用接口
* Input          : None               
* Output         : None
* Return         : None
*******************************************************************************/

void Temperature_Process(void)
{
  if (FALSE == Flag.ReadTempOneSec) return;
  Flag.ReadTempOneSec = FALSE;
  
  Temperature_Read();
}

/* ************ ****** ************ THE FILE END  ************ ****** ************ */

